Ran Plan for project: `diun-github-issue-creator` dir: `repositories/diun-github-issue-creator` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_file.codeowners must be replaced
-/+ resource "github_repository_file" "codeowners" {
      ~ commit_sha          = "ff181765920f500b719b926aba26f9f957684e63" -> (known after apply)
      ~ id                  = "a7d-corp/CODEOWNERS" -> (known after apply)
      ~ repository          = "a7d-corp" -> "diun-github-issue-creator" # forces replacement
      ~ sha                 = "77631e4ddbe10c8eab624fb03b36276dd677d2b6" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.workflow_changelog_validate must be replaced
-/+ resource "github_repository_file" "workflow_changelog_validate" {
      ~ commit_sha          = "e8cd321eba354f4279f90f0be52c5779599c734e" -> (known after apply)
      ~ id                  = "a7d-corp/.github/workflows/changelog-validate.yaml" -> (known after apply)
      ~ repository          = "a7d-corp" -> "diun-github-issue-creator" # forces replacement
      ~ sha                 = "3eaaf390a7473a48c88333eb87f4fce66bbf4890" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.workflow_create_release must be replaced
-/+ resource "github_repository_file" "workflow_create_release" {
      ~ commit_sha          = "970736b61f992b37a7fea15dcefd7c5ebcaa6f29" -> (known after apply)
      ~ id                  = "a7d-corp/.github/workflows/zz_generated.create_release.yaml" -> (known after apply)
      ~ repository          = "a7d-corp" -> "diun-github-issue-creator" # forces replacement
      ~ sha                 = "8c7011ebe5902c72694f09c1791a53f72acc178f" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # github_repository_file.workflow_create_release_pr must be replaced
-/+ resource "github_repository_file" "workflow_create_release_pr" {
      ~ commit_sha          = "bedba4012eb5229903a9d811f787c36815beac2b" -> (known after apply)
      ~ id                  = "a7d-corp/.github/workflows/zz_generated.create_release_pr.yaml" -> (known after apply)
      ~ repository          = "a7d-corp" -> "diun-github-issue-creator" # forces replacement
      ~ sha                 = "cd64efc2b7f1dd423855532979b4296f85413dee" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.github_repository.github_repository.repo will be updated in-place
~ resource "github_repository" "repo" {
      ~ description                 = "This is very meta" -> "Notifier for DIUN to create Github issues when an update is found"
        id                          = "a7d-corp"
      ~ name                        = "a7d-corp" -> "diun-github-issue-creator"
        # (31 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p diun-github-issue-creator`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fdiun-github-issue-creator%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p diun-github-issue-creator`
</details>
Plan: 4 to add, 1 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`